core/src/test/resources/org.helsinki.vismapay/get_payment_response_body.json

{
  "result": 0,
  "payment": {
    "id": 123,
    "amount": 562,
    "currency": "EUR",
    "order_number": "test_order_1",
    "created_at": "2018-09-12 08:30:22",
    "status": 4,
    "refund_type": "email",
    "source": {
      "object": "e-payment",
      "brand": "Nordea"
    },
    "customer": {
      "firstname": "Test",
      "lastname": "Person",
      "email": "test.person@vismapay.com",
      "address_street": "",
      "address_city": "",
      "address_zip": ""
    },
    "payment_products": [{
      "id": "as123",
      "product_id": 1123,
      "title": "Product 1",
      "count": 2,
      "pretax_price": 100,
      "tax": 24,
      "price": 124,
      "type": 1
    },
      {
        "id": "sku123",
        "product_id": 1124,
        "title": "Product 2",
        "count": 1,
        "pretax_price": 100,
        "tax": 14,
        "price": 114,
        "type": 1
      },
      {
        "id": "ab1",
        "product_id": 1125,
        "title": "Shipping",
        "count": 1,
        "pretax_price": 200,
        "tax": 0,
        "price": 200,
        "type": 2
      }],
    "refunds": [{
      "id": 123,
      "amount": -114,
      "created_at": "2018-09-12 09:09:01",
      "order_number": "test_order_1",
      "status": 9,
      "payment_products": [{
        "id": "sku123",
        "product_id": 1124,
        "title": "Product 2",
        "count": 1,
        "pretax_price": 100,
        "tax": 14,
        "price": 114,
        "type": 1
      }]
    }]
  }
}